Revit 2025 API
DuctFittingAndAccessoryData Properties
The DuctFittingAndAccessoryData type exposes the following members.
Properties
Name | Description
AirViscosity |  The kinematic viscosity of air for the duct fitting or duct accessory, Units: (ft^2/s).
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Origin |  The origin position of the duct fitting or duct accessory.
PartType |  The part type of the duct fitting or duct accessory.
ServerGUID |  The GUID of the duct fitting or duct accessory.
SystemClassification |  The system classification of the duct fitting or duct accessory.
Top
See Also
Reference
DuctFittingAndAccessoryData Class
Autodesk.Revit.DB.Mechanical Namespace